clc;  clear;  clf
% 最小二乘一次完成法
u=[-1,1,-1,1,1,1,1,-1,-1,-1,1,-1,-1,1,1]; % 输入一个周期M序列
z=zeros(1,16); % 定义输出观测值的长度
for k=3:16
    z(k)=1.5*z(k-1)-0.7*z(k-2)+u(k-1)+0.5*u(k-2); % 用理想输出值作为观测值
end
subplot(2,1,1) ;  stem(u)        % 画输入信号u的经线图形
axis([1,16, -1.5 ,1.5]);
subplot(2,1,2);   plot(1:16,z);  
hold on;             stem(z)         % 画出输出观测值z的经线图形

HL=[-z(2) -z(1) u(2) u(1);
    -z(3) -z(2) u(3) u(2);
    -z(4) -z(3) u(4) u(3);
    -z(5) -z(4) u(5) u(4);
    -z(6) -z(5) u(6) u(5);
    -z(7) -z(6) u(7) u(6);
    -z(8) -z(7) u(8) u(7);
    -z(9) -z(8) u(9) u(8);
    -z(10) -z(9) u(10) u(9);
    -z(11) -z(10) u(11) u(10);
    -z(12) -z(11) u(12) u(11);
    -z(13) -z(12) u(13) u(12);
    -z(14) -z(13) u(14) u(13);
    -z(15) -z(14) u(15) u(14)]; % 给样本矩阵HL赋值
ZL=[z(3);z(4);z(5);z(6);z(7);z(8);z(9);z(10);z(11);z(12);z(13);z(14);z(15);z(16)];% 给样本矩阵zL赋值
% 一次完成法，式7
c1=HL'*HL; c2=inv(c1); c3=HL'*ZL; c=c2*c3; 
a1=c(1); a2=c(2); b1=c(3);b2=c(4);                
name={'a1';'a2';'b1';'b2'};
par=[a1;a2;b1;b2];
table(par,'RowNames',name)

